
# Размерность вектора
EMBEDDINGS_DIMENSION = 2048

# Github API URL
GITHUB_API_BASE_URL = "https://api.github.com"

# Разделители BSL кода
BSL_SEPARATORS: list[str] = [
    # Разделение по началу процедур/функций
    "\nПроцедура ",
    "\nФункция ",
    # Разделение по управляющим конструкциям
    # "\nЕсли ",
    # "\nИначеЕсли ",
    # "\nИначе ",
    # "\nКонецЕсли",
    # "\nДля ",
    # "\nЦикл ",
    # "\nПока ",
    # "\nПопытка ",
    # "\nИсключение ",
    # Разделение по объявлениям переменных
    # "\nПерем ",
    # Разделение по ключевым словам модуля
    "\n#Область ",
    "\n#КонецОбласти",
    # Разделение по комментариям
    "\n//",
    # Стандартные разделители
    "\n\n",
    "\n",
    " ",
    "",
]
